---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.DuctSizes.GetDuctSizeIterator
source: html/af6c24af-10d9-6ad7-19f9-7bac13bbc9e2.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSizes.GetDuctSizeIterator Method

Returns a DuctSizeIterator that iterates through the collection.

## Syntax (C#)
```csharp
public DuctSizeIterator GetDuctSizeIterator()
```

## Returns
A DuctSizeIterator object that can be used to iterate through key-value pairs in the collection.